Ran Plan for 3 projects:

1. project: `bucket` dir: `bucket` workspace: `default`
1. project: `seed` dir: `seed` workspace: `default`
1. project: `frontend` dir: `frontend` workspace: `default`

### 1. project: `bucket` dir: `bucket` workspace: `default`
```diff

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p bucket`
* :put_litter_in_its_place: To **delete** this plan click [here](http://663dd4204f4a:4141/lock?id=dmalicia%252Fdm-terraform%252Fbucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p bucket`

---
### 2. project: `seed` dir: `seed` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.seed001 must be replaced
-/+ resource "google_compute_instance" "seed001" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/heroic-muse-289316/zones/us-west1-a/instances/dm-seed1-6e291ed314bc831a" -> (known after apply)
      ~ instance_id             = "5066876876657232166" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "dwPE3_i5IqI=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            sudo apt-get update;
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10;
            echo "sleep 10" >> /tmp/meio;
          - docker run --name atlantis -d -p 4141:4141 runatlantis/atlantis server --gh-user=dmalicia --gh-token=bc8e56a78d8b788dafc01e0d03ba2aed89abe9cd --repo-allowlist github.com/dmalicia/dm-terraform --repo-config=/repos.yaml
          - echo $token
          + docker run -d --name atlantis -p 4141:4141 runatlantis/atlantis server --gh-user=dmalicia --gh-token=672d727d71584c0ab17e6bc5a80ca77298a99147 --repo-allowlist github.com/dmalicia/dm-terraform --repo-config=/repos.yaml;
          + 
            echo "sleep docker is up?" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            docker cp /usr/local/share/dm-terraform/seed/bootstrap/initdm.sh atlantis:/
            docker cp /usr/local/share/dm-terraform/seed/bootstrap/repos.yaml atlantis:/
            docker restart atlantis
            cat >> /config.yml <<EOF
            web_addr: localhost:41414
            tunnels:
              atlantis:
                addr: 4141
                bind_tls: true
                proto: http
            EOF
            wget https://bin.equinox.io/c/4VmDzA7iaHb/ngrok-stable-linux-amd64.zip /
            unzip /ngrok-stable-linux-amd64.zip 
            ./ngrok start atlantis --config /config.yml -log=/tmp/klog > /dev/null &
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            echo "instalou?" >> /tmp/meio;
            sudo apt-get update
            sudo apt-get install puppetmaster-passenger -yq
          - #sudo puppet master
          - docker cp /usr/local/share/dm-terraform/seed/creds.json atlantis:/tmp
          + sudo puppet master
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "dm-seed1-6e291ed314bc831a"
      ~ project                 = "heroic-muse-289316" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/instances/dm-seed1-6e291ed314bc831a" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
        zone                    = "us-west1-a"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/disks/dm-seed1-6e291ed314bc831a" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910" -> "debian-cloud/debian-9"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          ~ network_ip         = "10.138.0.38" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west1/subnetworks/default" -> (known after apply)
          ~ subnetwork_project = "heroic-muse-289316" -> (known after apply)

          ~ access_config {
                nat_ip       = "35.233.219.1"
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seed`
* :put_litter_in_its_place: To **delete** this plan click [here](http://663dd4204f4a:4141/lock?id=dmalicia%252Fdm-terraform%252Fseed%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seed`
</details>

---
### 3. project: `frontend` dir: `frontend` workspace: `default`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_compute_firewall.frontend will be created
+ resource "google_compute_firewall" "frontend" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "frontend-firewall"
      + network            = "default"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)

      + allow {
          + ports    = [
              + "80",
              + "8140",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.frontendn will be destroyed
- resource "google_compute_firewall" "frontendn" {
      - creation_timestamp      = "2020-09-18T18:54:51.701-07:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/heroic-muse-289316/global/firewalls/frontend-firewall" -> null
      - name                    = "frontend-firewall" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> null
      - priority                = 1000 -> null
      - project                 = "heroic-muse-289316" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/firewalls/frontend-firewall" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "80",
              - "8140",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_instance.frontend[0] will be created
+ resource "google_compute_instance" "frontend" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update;
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10;
            echo "sleep 10" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            echo "instalou?" >> /tmp/meio;
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = 35.233.219.1
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            sudo service restart puppet
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "dm-frontend-08aee1323848f94e7"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-west1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = "34.83.223.97"
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.frontendn[0] will be destroyed
- resource "google_compute_instance" "frontendn" {
      - can_ip_forward          = false -> null
      - cpu_platform            = "Intel Broadwell" -> null
      - current_status          = "RUNNING" -> null
      - deletion_protection     = false -> null
      - enable_display          = false -> null
      - guest_accelerator       = [] -> null
      - id                      = "projects/2036174436/zones/us-west1-a/instances/dm-frontend-08aee1323848f94e7" -> null
      - instance_id             = "8914627619174716270" -> null
      - label_fingerprint       = "42WmSpB8rSM=" -> null
      - labels                  = {} -> null
      - machine_type            = "f1-micro" -> null
      - metadata                = {
          - "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        } -> null
      - metadata_fingerprint    = "8IWirg5vSQA=" -> null
      - metadata_startup_script = <<~EOT
            sudo apt-get update;
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip;
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`;
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sleep 3
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10;
            echo "sleep 10" >> /tmp/meio;
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            echo "instalou?" >> /tmp/meio;
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = 35.233.219.1
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            sudo service restart puppet
        EOT -> null
      - name                    = "dm-frontend-08aee1323848f94e7" -> null
      - project                 = "2036174436" -> null
      - resource_policies       = [] -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/instances/dm-frontend-08aee1323848f94e7" -> null
      - tags                    = [] -> null
      - tags_fingerprint        = "42WmSpB8rSM=" -> null
      - zone                    = "us-west1-a" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west1-a/disks/dm-frontend-08aee1323848f94e7" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/debian-cloud/global/images/debian-9-stretch-v20200910" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> null
          - network_ip         = "10.138.0.37" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west1/subnetworks/default" -> null
          - subnetwork_project = "heroic-muse-289316" -> null

          - access_config {
              - nat_ip       = "34.83.223.97" -> null
              - network_tier = "PREMIUM" -> null
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend`
* :put_litter_in_its_place: To **delete** this plan click [here](http://663dd4204f4a:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
